Revit API Introduction Labs
Lab4_2_ExportParametersToExcel.Execute Method
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public Result Execute(
	ExternalCommandData commandData,
	ref string message,
	ElementSet elements
)
Visual Basic (Declaration)
Public Function Execute ( _
	commandData As ExternalCommandData, _
	ByRef message As String, _
	elements As ElementSet _
) As Result
Visual C++
public:
virtual Result Execute(
	ExternalCommandData^ commandData,
	String^% message,
	ElementSet^ elements
) sealed
Parameters
commandData
Type: ExternalCommandData
message
Type: System.String
elements
Type: ElementSet
Implements
IExternalCommandExecute(ExternalCommandData, String, ElementSet)
See Also
Lab4_2_ExportParametersToExcel Class
Labs Namespace